package com.example.umechika.samples

import com.mapbox.geojson.Point


// 出発地点と目的地を設定（例: 東京駅から大阪駅）
val toHansinFromHankyu = listOf(
    Point.fromLngLat(135.4984766789686, 34.704913388957145), // 阪急2階改札
    Point.fromLngLat(135.4985199266149, 34.704778284847464),   // 阪急2階->1階階段
    Point.fromLngLat(135.4985670184965, 34.704617897810984), // 阪急1階広場
    Point.fromLngLat(135.4985788999545, 34.70451937712329),    // 阪急1階->地下1階階段
    Point.fromLngLat(135.49859799544188, 34.70440948839173),     // 阪急地下1階フロア
    Point.fromLngLat(135.49899298829416, 34.70444858650656),  // 阪急地下1階->2階階段
    Point.fromLngLat(135.4992587179493, 34.70447219742713),    // 地下2階ダイソー前右折地点 エリア5
    Point.fromLngLat(135.49949133101376, 34.703761014301215),  // HEP FIVE前　エリア6
    Point.fromLngLat(135.49956571493908, 34.70352234107359),     // 阪急メンズ大阪北 エリア7
    Point.fromLngLat(135.49959370900842, 34.703291479781626),   // 阪急メンズ大阪中央　エリア8
    Point.fromLngLat(135.49954756602526, 34.702981013910765),  // 阪急メンズ大阪南　エリア9
    Point.fromLngLat(135.4995081868019, 34.7027931539833), //ちょうど何もない空間　エリア10
    Point.fromLngLat(135.49947960694243, 34.702658891198475),   // Y字路合流前　エリア11
    Point.fromLngLat(135.4994845843682, 34.70236694793086), // Y字路合流地点  エリア12
    Point.fromLngLat(135.4994209607231, 34.702054354906),  // ノースモール最終地点 エリア13
    Point.fromLngLat(135.49937248472025, 34.70186027754869),   // スクランブル   エリア14
    Point.fromLngLat(135.49899652463708, 34.70181499131814),   // サウスモール合流地点 エリア16
    Point.fromLngLat(135.49874204895076, 34.7017905579035),    // 通常の通路  エリア17
    Point.fromLngLat(135.4982682340365, 34.70181205452546),    // 阪神大阪梅田前広場? エリア18
)
// 距離は520ｍ程度らしい
